In [1]:
import pandas as pd

In [3]:
data = {
    "admitted_date": ['20210909', '20210103', '20220909', '20220202'],
    "room_rate_total": [1200,2300,1200,1000],
    'admission_id': ['adm-usa-1', 'adm-usa-2', 'adm-usa-3', 'adm-usa-4',]
}

df = pd.DataFrame(data)
df

  admitted_date  room_rate_total admission_id
0      20210909             1200    adm-usa-1
1      20210103             2300    adm-usa-2
2      20220909             1200    adm-usa-3
3      20220202             1000    adm-usa-4

In [4]:
df['admitted_date'] = pd.to_datetime(df['admitted_date'])
df

  admitted_date  room_rate_total admission_id
0    2021-09-09             1200    adm-usa-1
1    2021-01-03             2300    adm-usa-2
2    2022-09-09             1200    adm-usa-3
3    2022-02-02             1000    adm-usa-4

In [5]:
df['year'] = df['admitted_date'].dt.year
df

  admitted_date  room_rate_total admission_id  year
0    2021-09-09             1200    adm-usa-1  2021
1    2021-01-03             2300    adm-usa-2  2021
2    2022-09-09             1200    adm-usa-3  2022
3    2022-02-02             1000    adm-usa-4  2022

In [6]:
df.groupby('year')[['room_rate_total']].sum()

      room_rate_total
year
2021             3500
2022             2200

In [8]:
df.groupby('year')[['admission_id']].count()

      admission_id
year
2021             2
2022             2

In [9]:
df[df['admitted_date'].dt.year==2021]

  admitted_date  room_rate_total admission_id  year
0    2021-09-09             1200    adm-usa-1  2021
1    2021-01-03             2300    adm-usa-2  2021

In [18]:
tojson = df.to_json()
tojson

'{"admitted_date":{"0":1631145600000,"1":1609632000000,"2":1662681600000,"3":1643760000000},"room_rate_total":{"0":1200,"1":2300,"2":1200,"3":1000},"admission_id":{"0":"adm-usa-1","1":"adm-usa-2","2":"adm-usa-3","3":"adm-usa-4"},"year":{"0":2021,"1":2021,"2":2022,"3":2022}}'

In [19]:
type(tojson)

str

In [17]:
import json

In [20]:
json.loads(tojson)

{'admitted_date': {'0': 1631145600000,
  '1': 1609632000000,
  '2': 1662681600000,
  '3': 1643760000000},
 'room_rate_total': {'0': 1200, '1': 2300, '2': 1200, '3': 1000},
 'admission_id': {'0': 'adm-usa-1',
  '1': 'adm-usa-2',
  '2': 'adm-usa-3',
  '3': 'adm-usa-4'},
 'year': {'0': 2021, '1': 2021, '2': 2022, '3': 2022}}

In [25]:
tojson = df.to_json()
tojson

'{"admitted_date":{"0":1631145600000,"1":1609632000000,"2":1662681600000,"3":1643760000000},"room_rate_total":{"0":1200,"1":2300,"2":1200,"3":1000},"admission_id":{"0":"adm-usa-1","1":"adm-usa-2","2":"adm-usa-3","3":"adm-usa-4"},"year":{"0":2021,"1":2021,"2":2022,"3":2022}}'

In [26]:
df['quarter'] = df['admitted_date'].dt.quarter
df

  admitted_date  room_rate_total admission_id  year  quarter
0    2021-09-09             1200    adm-usa-1  2021        3
1    2021-01-03             2300    adm-usa-2  2021        1
2    2022-09-09             1200    adm-usa-3  2022        3
3    2022-02-02             1000    adm-usa-4  2022        1

In [27]:
df['month'] = df['admitted_date'].dt.month
df

  admitted_date  room_rate_total admission_id  year  quarter  month
0    2021-09-09             1200    adm-usa-1  2021        3      9
1    2021-01-03             2300    adm-usa-2  2021        1      1
2    2022-09-09             1200    adm-usa-3  2022        3      9
3    2022-02-02             1000    adm-usa-4  2022        1      2

In [28]:
from IPython.display import HTML

In [29]:
HTML(df.to_html(classes='table table-stripped'))

In [30]:
df.to_html(classes='table table-stripped')

'<table border="1" class="dataframe table table-stripped">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>admitted_date</th>\n      <th>room_rate_total</th>\n      <th>admission_id</th>\n      <th>year</th>\n      <th>quarter</th>\n      <th>month</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>2021-09-09</td>\n      <td>1200</td>\n      <td>adm-usa-1</td>\n      <td>2021</td>\n      <td>3</td>\n      <td>9</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>2021-01-03</td>\n      <td>2300</td>\n      <td>adm-usa-2</td>\n      <td>2021</td>\n      <td>1</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>2022-09-09</td>\n      <td>1200</td>\n      <td>adm-usa-3</td>\n      <td>2022</td>\n      <td>3</td>\n      <td>9</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>2022-02-02</td>\n      <td>1000</td>\n      <td>adm-usa-4</td>\n      <td>2022</td>\n      <td>1</td>\n      <td>2</td>\n    </tr>\n  </tbody>\n</table>'